<?php

namespace App\Consts;

class WeightClassConst
{
    // 男性用階級
    const MAN_CLASS_LIST = [
        1 => '55kg級',
        2 => '61kg級',
        3 => '67kg級',
        4 => '73kg級',
        5 => '81kg級',
        6 => '89kg級',
        7 => '96kg級',
        8 => '102kg級',
        9 => '109kg級',
        10 => '109kg超級'
    ];

    // 女性用階級
    const WOMAN_CLASS_LIST = [
        1 => '45kg級',
        2 => '49kg級',
        3 => '55kg級',
        4 => '59kg級',
        5 => '64kg級',
        6 => '71kg級',
        7 => '76kg級',
        8 => '81kg級',
        9 => '87kg級',
        10 => '87kg超級'
    ];

    // 階級選択用
    const CLASS_LIST = [
        1 => '55kg級',
        2 => '61kg級',
        3 => '67kg級',
        4 => '73kg級',
        5 => '81kg級',
        6 => '89kg級',
        7 => '96kg級',
        8 => '102kg級',
        9 => '109kg級',
        10 => '109kg超級',
        11 => '45kg級',
        12 => '49kg級',
        13 => '55kg級',
        14 => '59kg級',
        15 => '64kg級',
        16 => '71kg級',
        17 => '76kg級',
        18 => '81kg級',
        19 => '87kg級',
        20 => '87kg超級'
    ];
}
