<p>{{ $toUser->name }}様</p>

<p><b>{{ $request['last_name'] . $request['first_name']}}様からお問い合わせがありました。</b></p>
<p>---------------------------------------------------------------------------------------</p>
<p><b>タイトル</b></p>
<p>{{ $request['title'] }}</p>
<br>
<p><b>お問い合わせ内容</b></p>
<p>{!! nl2br(e($request['content'])) !!}</p>
<p>---------------------------------------------------------------------------------------</p>
<br>
<p>※何ご不明な点がありましたらシステム管理者にお問い合わせください。</p>
<p>※お問い合わせ内容につきましては解答しかねますのでよろしくお願い致します。</p>

<x-mail.admin-info></x-mail.admin-info>
