<p>{{ $request['last_name'] . $request['first_name']}}様</p>

<p>お問い合わせいただきありがとうございます。</p>
<p>本メールはお問合せ送信確認メールになります。</p>
<p>現在お問合せ内容を精査していますので今しばらくお待ちください。</p>
<p>なお、本メールにお心当たりのない場合、破棄して頂けるようお願いいたします。</p>

<br>
<br>
<br>
<div>
----------------------------------------------------------------------------------------- <br>
福岡県ウエイトリフティング協会 <br>
メールアドレス：fukuokaweight@gmail.com<br>
所在地　　　　：北九州市八幡西区元城町一番一号<br>
　　　　　　　　福岡県立八幡中央高等学校<br>
------------------------------------------------------------------------------------------ <br>
</div>
